[
  {
    "id": "riveter-infrastructure-drift-detection",
    "title": "Riveter - Infrastructure Drift Detection",
    "description": "Python CLI tool for defining and detecting custom infrastructure drift in Terraform configurations beyond standard cloud provider capabilities.",
    "longDescription": "Comprehensive infrastructure drift detection tool built with Python that enables organizations to define custom drift detection rules using YAML. Features direct scanning of Terraform configurations, support for complex rule definitions covering security groups, instance types, storage encryption, and resource tags. Built with a modular architecture including separate modules for Terraform parsing (python-hcl2), rule validation (PyYAML), resource scanning, and rich terminal reporting. Supports filtering by tags and nested attribute checking with detailed violation reporting.",
    "motivation": "Created to address the limitations of standard cloud provider drift detection by enabling custom rule definitions that enforce organization-specific infrastructure standards. The tool fills the gap between basic Terraform state management and comprehensive compliance checking, allowing teams to codify their infrastructure policies and automatically detect violations during CI/CD processes.",
    "technologies": [
      "Python",
      "Click",
      "python-hcl2",
      "PyYAML",
      "Rich",
      "pytest",
      "Terraform",
      "YAML",
      "CLI Development"
    ],
    "images": [
      "/images/riveter.jpg"
    ],
    "featured": true,
    "startDate": "2025-05-01",
    "status": "in-progress"
  },
  {
    "id": "monopoly-go-sticker-tracker",
    "title": "Monopoly GO! Sticker Tracker",
    "description": "Web-based tool for tracking Monopoly GO! sticker collections with real-time synchronization and multi-player support.",
    "longDescription": "Comprehensive sticker collection management tool built with vanilla JavaScript and Firebase. Features include real-time synchronization across devices, multi-player support, advanced search functionality, secure passcode protection, and mobile-optimized touch interface. Supports unlimited sticker sets with customizable names, color-coded status tracking (need/have/extra), and data export/import capabilities.",
    "motivation": "Created to solve the challenge of coordinating sticker trades among Monopoly GO! players. The tool addresses the need for real-time collaboration, mobile accessibility, and secure data management while maintaining optimal performance through vanilla JavaScript implementation.",
    "technologies": [
      "JavaScript",
      "HTML5",
      "CSS3",
      "Firebase",
      "Responsive Design",
      "Mobile Optimization",
      "Real-time Database"
    ],
    "images": [
      "/images/monopoly_go.jpg"
    ],
    "featured": true,
    "startDate": "2025-02-01",
    "status": "completed"
  },
  {
    "id": "personal-proj-1",
    "title": "Personal Portfolio Website",
    "description": "Modern, performant personal website built with Next.js, TypeScript, and Tailwind CSS showcasing professional experience and projects.",
    "longDescription": "Designed and developed a comprehensive personal portfolio website using Next.js 14 with App Router, TypeScript, and Tailwind CSS. The site features a fully responsive design optimized for mobile, tablet, and desktop devices with Lighthouse scores of 90+ across all metrics. Implemented WCAG 2.1 Level AA accessibility compliance, SEO optimization with meta tags and structured data, and comprehensive testing with Vitest and Playwright. The site is deployed on Vercel with automatic CI/CD from GitHub.",
    "motivation": "I wanted to create a professional online presence that showcases my DevOps and software engineering experience while demonstrating my full-stack development capabilities. This project allowed me to explore modern web technologies and best practices in performance optimization, accessibility, and SEO. Built with the assistance of Kiro AI IDE, this project showcases how AI-powered development tools can accelerate the creation of production-ready applications.",
    "technologies": [
      "Next.js",
      "TypeScript",
      "React",
      "Tailwind CSS",
      "Vercel",
      "Vitest",
      "Playwright",
      "Kiro AI"
    ],
    "images": [
      "/images/kiro.svg"
    ],
    "featured": true,
    "startDate": "2025-10-01",
    "status": "completed"
  }
]