[
  {
    "id": "work-proj-1",
    "title": "DevEx Platform for Major Retail Company",
    "description": "Enterprise developer experience platform automating infrastructure and application configurations using Terraform, Backstage, and AI tooling.",
    "longDescription": "Co-led a team of six engineers in building a comprehensive DevEx platform for a major retail company. The platform leverages Terraform, Backstage, GitHub, and AI tooling to automate infrastructure and application configurations for Azure Function and Container apps. This solution significantly improved developer productivity and reduced deployment complexity across the organization.",
    "technologies": ["Terraform", "Backstage", "GitHub", "Azure Functions", "Azure Container Apps", "AI Tooling", "Python"],
    "companyId": "liatrio",
    "experienceId": "exp-1",
    "images": ["/images/retail.jpg"],
    "featured": true,
    "startDate": "2023-02"
  },
  {
    "id": "work-proj-2",
    "title": "Airline Cybersecurity Automation",
    "description": "Automated deployment system for cybersecurity applications using Terraform, GitLab, and Docker for a major airline.",
    "longDescription": "Engineered comprehensive automation processes for a major airline's cybersecurity infrastructure. Utilized Terraform, GitLab, and Docker to significantly improve the deployment efficiency of cybersecurity applications in Ping with SAML, OAuth, and OpenID configurations. The solution streamlined security deployments and reduced manual configuration errors.",
    "technologies": ["Terraform", "GitLab", "Docker", "Ping", "SAML", "OAuth", "OpenID"],
    "companyId": "liatrio",
    "experienceId": "exp-1",
    "images": ["/images/airplane.jpg"],
    "featured": true,
    "startDate": "2023-06"
  },
  {
    "id": "work-proj-3",
    "title": "GitLab Pipeline Monitoring Solution",
    "description": "Architected GitLab pipeline solutions to monitor production releases and enhance Terraform plan clarity.",
    "longDescription": "Architected and implemented GitLab pipeline solutions to monitor production releases and enhance the clarity of Terraform plans for application teams. This initiative led to a 100% reduction in P2 incidents and streamlined the release process. The solution provided better visibility into infrastructure changes and improved team confidence in deployments.",
    "technologies": ["GitLab CI/CD", "Terraform", "Python", "Monitoring"],
    "companyId": "liatrio",
    "experienceId": "exp-1",
    "images": ["/images/gitlab.png"],
    "featured": true,
    "startDate": "2023-08",
    "endDate": "2024-01"
  },
  {
    "id": "work-proj-4",
    "title": "Multi-Region AWS Infrastructure",
    "description": "Designed and implemented scalable multi-account, multi-region AWS infrastructure for fintech payment platform.",
    "longDescription": "Designed and implemented a comprehensive AWS account structure using AWS Organizations and Resource Access Management, resulting in a maintainable multi-account, multi-region environment. Engineered a multi-region AWS network architecture using AWS VPC, Subnets, and gateways, along with a meticulously planned CIDR assignment strategy. The infrastructure was positioned for efficiency and growth in a fintech payment environment.",
    "technologies": ["AWS", "AWS Organizations", "AWS VPC", "Terraform", "Multi-region Architecture", "CIDR Planning"],
    "companyId": "apto",
    "experienceId": "exp-2",
    "images": ["/images/aws.jpg"],
    "featured": true,
    "startDate": "2022-07",
    "endDate": "2022-11"
  },
  {
    "id": "work-proj-5",
    "title": "Healthcare Infrastructure Migration",
    "description": "Led Infrastructure-as-Code migration project for healthcare client using AWS CDK in multi-account environment.",
    "longDescription": "Co-led Infrastructure-as-Code and migration projects for life science and healthcare clients, utilizing Agile methodologies and AWS DevOps services. Implemented infrastructure solutions with AWS CDK in a multi-account environment and automated the migration process, significantly improving operational efficiency and reducing deployment time. The project ensured HIPAA compliance and enhanced system reliability.",
    "technologies": ["AWS CDK", "Terraform", "AWS", "Jenkins", "Python", "Multi-account Architecture"],
    "companyId": "pariveda",
    "experienceId": "exp-3",
    "images": ["/images/healthcare.jpeg"],
    "featured": true,
    "startDate": "2020-03",
    "endDate": "2021-06"
  },
  {
    "id": "work-proj-6",
    "title": "P2P Payment Platform Enhancement",
    "description": "Enhanced financial dispute services and debit card reissue processes for $3 billion peer-to-peer payment company.",
    "longDescription": "Enhanced financial dispute services and streamlined debit card reissue processes for a $3 billion peer-to-peer payment company using Python and Apache Kafka. The improvements significantly enhanced user experience and reduced a core KPI from 2% to 0%. Led a code standardization initiative for a 20,000-line codebase, ensuring PEP8 compliance and creating a scalable solution applicable to the entire platform.",
    "technologies": ["Python", "Apache Kafka", "React", "JavaScript", "Azure DevOps"],
    "companyId": "pariveda",
    "experienceId": "exp-3",
    "images": ["/images/payment.jpg"],
    "featured": true,
    "startDate": "2021-01",
    "endDate": "2022-03"
  },
  {
    "id": "work-proj-7",
    "title": "University Grant Management Application",
    "description": "Developed application for university researchers to manage grant financials using JavaScript and React.",
    "longDescription": "Developed a comprehensive application for university researchers using JavaScript and React to manage grant financials. Conducted interviews with end users to establish pain points and gather feedback during the development process. The application streamlined grant management workflows and improved financial tracking for research projects.",
    "technologies": ["JavaScript", "React", "Node.js", "Azure"],
    "companyId": "pariveda",
    "experienceId": "exp-3",
    "images": ["/images/university.jpg"],
    "featured": false,
    "startDate": "2020-06",
    "endDate": "2020-12"
  }
]
